2024.11.12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-12 Tue 15:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2024.11.05.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2024.11.19.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of November 05 to 12, 2024.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Picos — Interoperable effects based concurrency</a></li>
<li><a href="#2">findlib-1.9.7</a></li>
<li><a href="#3">First release candidate for OCaml 5.2.1</a></li>
<li><a href="#4">mirage-swapfs</a></li>
<li><a href="#5">Dune dev meeting</a></li>
<li><a href="#6">Other OCaml News</a></li>
<li><a href="#org48911c6">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">Picos — Interoperable effects based concurrency</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-picos-interoperable-effects-based-concurrency/14507/3">https://discuss.ocaml.org/t/ann-picos-interoperable-effects-based-concurrency/14507/3</a>
</p>
</div>
