2024.11.12.org
** polytypic announced


I'm happy to announce that Picos version 0.6.0 has been released!

#+begin_quote
Picos is a systems programming interface between effects based schedulers and concurrent abstractions.
#+end_quote

A lot of work has been done on Picos since previous announcements.

You might start on the new minimalist landing page for [[https://ocaml-multicore.github.io/picos/][Picos]], which, among other things, allows you to access the documentation of all the released Picos versions.

Also, in case you missed it, a recording of the talk

#+begin_quote
[[https://icfp24.sigplan.org/details/ocaml-2024-papers/5/Picos-Interoperable-effects-based-concurrency][Picos — Interoperable effects based concurrency]]
#+end_quote

can be found [[https://youtu.be/OuQqblCxJ2Y?t=20115][here]].

We also held a workshop on concurrency and parallelism at [[https://fun-ocaml.com/][Fun OCaml]]. You might enjoy trying out [[https://github.com/ocaml-multicore/fun-ocaml-workshop][the exercise we developed for the workshop]].

As, for reasons of dependencies, Picos now comes in no less than [[https://ocaml-multicore.github.io/picos/0.6.0/][8 packages]] and multiple libraries, here is a summary of the packages and the libraries inside each package:

- [[https://ocaml-multicore.github.io/picos/0.6.0/picos/index.html][~picos~]] — Picos — Interoperable effects based concurrency
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos/index.html][~picos~]] — A systems programming interface between effects based schedulers and concurrent abstractions
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos_domain/index.html][~picos.domain~]] — Minimalistic domain API available both on OCaml 5 and on OCaml 4
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos_thread/index.html][~picos.thread~]] — Minimalistic thread API available with or without threads.posix

- [[https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/index.html][~picos_mux~]] — Sample schedulers for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_fifo/index.html][~picos_mux.fifo~]] — Basic single-threaded effects based Picos compatible scheduler for OCaml 5
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_multififo/index.html][~picos_mux.multififo~]] — Basic multi-threaded effects based Picos compatible scheduler for OCaml 5
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_random/index.html][~picos_mux.random~]] — Randomized multi-threaded effects based Picos compatible scheduler for OCaml 5
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_thread/index.html][~picos_mux.thread~]] — Basic Thread based Picos compatible scheduler for OCaml 4

- [[https://ocaml-multicore.github.io/picos/0.6.0/picos_std/index.html][~picos_std~]] — Sample libraries for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_finally/index.html][~picos_std.finally~]] — Syntax for avoiding resource leaks for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_awaitable/index.html][~picos_std.awaitable~]] — Basic futex-like awaitable atomic location for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_event/index.html][~picos_std.event~]] — Basic event abstraction for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_structured/index.html][~picos_std.structured~]] — Basic structured concurrency primitives for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_sync/index.html][~picos_std.sync~]] — Basic communication and synchronization primitives for Picos

- [[https://ocaml-multicore.github.io/picos/0.6.0/picos_io/index.html][~picos_io~]] — Asynchronous IO system for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io/index.html][~picos_io~]] — Basic IO facilities based on OCaml standard libraries for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io_select/index.html][~picos_io.select~]] — Basic Unix.select based IO event loop for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io_fd/index.html][~picos_io.fd~]] — Externally reference counted file descriptors

- [[https://ocaml-multicore.github.io/picos/0.6.0/picos_io_cohttp/index.html][~picos_io_cohttp~]] — Cohttp running on Picos IO
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_io_cohttp/Picos_io_cohttp/index.html][~picos_io_cohttp~]] — Minimalistic Cohttp implementation using Picos_io for Picos

- [[https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/index.html][~picos_lwt~]] — Lwt interface for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/Picos_lwt/index.html][~picos_lwt~]] — Direct style Picos compatible interface to Lwt for OCaml 5
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/Picos_lwt_unix/index.html][~picos_lwt.unix~]] — Direct style Picos compatible interface to Lwt with Lwt_unix for OCaml 5

- [[https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/index.html][~picos_aux~]] — Auxiliary libraries for Picos
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_htbl/index.html][~picos_aux.htbl~]] — Lock-free hash table
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_mpmcq/index.html][~picos_aux.mpmcq~]] — Lock-free multi-producer, multi-consumer queue
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_mpscq/index.html][~picos_aux.mpscq~]] — Lock-free multi-producer, single-consumer queue
  - [[https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_rc/index.html][~picos_aux.rc~]] — External reference counting tables for disposable resources

- [[https://ocaml-multicore.github.io/picos/0.6.0/picos_meta/index.html][~picos_meta~]] — Integration tests for Picos packages

In addition to the above, [[https://github.com/c-cube/moonpool][Moonpool]] now uses Picos underneath.

And, I almost forgot, there is a ready to be merged [[https://github.com/ocaml-multicore/kcas/pull/204][PR for Kcas to change it to use Picos]].  You should be able to try it with an opam [[https://opam.ocaml.org/doc/Manual.html#opamfield-pin-depends][pin-depends]].
      



