2024.11.12.html
<div id="outline-container-org9bd6e3f" class="outline-3">
<h3 id="org9bd6e3f">polytypic announced</h3>
<div class="outline-text-3" id="text-org9bd6e3f">
<p>
I'm happy to announce that Picos version 0.6.0 has been released!
</p>

<blockquote>
<p>
Picos is a systems programming interface between effects based schedulers and concurrent abstractions.
</p>
</blockquote>

<p>
A lot of work has been done on Picos since previous announcements.
</p>

<p>
You might start on the new minimalist landing page for <a href="https://ocaml-multicore.github.io/picos/">Picos</a>, which, among other things, allows you to access the documentation of all the released Picos versions.
</p>

<p>
Also, in case you missed it, a recording of the talk
</p>

<blockquote>
<p>
<a href="https://icfp24.sigplan.org/details/ocaml-2024-papers/5/Picos-Interoperable-effects-based-concurrency">Picos — Interoperable effects based concurrency</a>
</p>
</blockquote>

<p>
can be found <a href="https://youtu.be/OuQqblCxJ2Y?t=20115">here</a>.
</p>

<p>
We also held a workshop on concurrency and parallelism at <a href="https://fun-ocaml.com/">Fun OCaml</a>. You might enjoy trying out <a href="https://github.com/ocaml-multicore/fun-ocaml-workshop">the exercise we developed for the workshop</a>.
</p>

<p>
As, for reasons of dependencies, Picos now comes in no less than <a href="https://ocaml-multicore.github.io/picos/0.6.0/">8 packages</a> and multiple libraries, here is a summary of the packages and the libraries inside each package:
</p>

<ul class="org-ul">
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos/index.html"><code>picos</code></a> — Picos — Interoperable effects based concurrency
<ul class="org-ul">
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos/index.html"><code>picos</code></a> — A systems programming interface between effects based schedulers and concurrent abstractions</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos_domain/index.html"><code>picos.domain</code></a> — Minimalistic domain API available both on OCaml 5 and on OCaml 4</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos_thread/index.html"><code>picos.thread</code></a> — Minimalistic thread API available with or without threads.posix</li>
</ul></li>

<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/index.html"><code>picos_mux</code></a> — Sample schedulers for Picos
<ul class="org-ul">
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_fifo/index.html"><code>picos_mux.fifo</code></a> — Basic single-threaded effects based Picos compatible scheduler for OCaml 5</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_multififo/index.html"><code>picos_mux.multififo</code></a> — Basic multi-threaded effects based Picos compatible scheduler for OCaml 5</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_random/index.html"><code>picos_mux.random</code></a> — Randomized multi-threaded effects based Picos compatible scheduler for OCaml 5</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_thread/index.html"><code>picos_mux.thread</code></a> — Basic Thread based Picos compatible scheduler for OCaml 4</li>
</ul></li>

<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_std/index.html"><code>picos_std</code></a> — Sample libraries for Picos
<ul class="org-ul">
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_finally/index.html"><code>picos_std.finally</code></a> — Syntax for avoiding resource leaks for Picos</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_awaitable/index.html"><code>picos_std.awaitable</code></a> — Basic futex-like awaitable atomic location for Picos</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_event/index.html"><code>picos_std.event</code></a> — Basic event abstraction for Picos</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_structured/index.html"><code>picos_std.structured</code></a> — Basic structured concurrency primitives for Picos</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_sync/index.html"><code>picos_std.sync</code></a> — Basic communication and synchronization primitives for Picos</li>
</ul></li>

<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_io/index.html"><code>picos_io</code></a> — Asynchronous IO system for Picos
<ul class="org-ul">
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io/index.html"><code>picos_io</code></a> — Basic IO facilities based on OCaml standard libraries for Picos</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io_select/index.html"><code>picos_io.select</code></a> — Basic Unix.select based IO event loop for Picos</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io_fd/index.html"><code>picos_io.fd</code></a> — Externally reference counted file descriptors</li>
</ul></li>

<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_io_cohttp/index.html"><code>picos_io_cohttp</code></a> — Cohttp running on Picos IO
<ul class="org-ul">
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_io_cohttp/Picos_io_cohttp/index.html"><code>picos_io_cohttp</code></a> — Minimalistic Cohttp implementation using Picos_io for Picos</li>
</ul></li>

<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/index.html"><code>picos_lwt</code></a> — Lwt interface for Picos
<ul class="org-ul">
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/Picos_lwt/index.html"><code>picos_lwt</code></a> — Direct style Picos compatible interface to Lwt for OCaml 5</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/Picos_lwt_unix/index.html"><code>picos_lwt.unix</code></a> — Direct style Picos compatible interface to Lwt with Lwt_unix for OCaml 5</li>
</ul></li>

<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/index.html"><code>picos_aux</code></a> — Auxiliary libraries for Picos
<ul class="org-ul">
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_htbl/index.html"><code>picos_aux.htbl</code></a> — Lock-free hash table</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_mpmcq/index.html"><code>picos_aux.mpmcq</code></a> — Lock-free multi-producer, multi-consumer queue</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_mpscq/index.html"><code>picos_aux.mpscq</code></a> — Lock-free multi-producer, single-consumer queue</li>
<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_rc/index.html"><code>picos_aux.rc</code></a> — External reference counting tables for disposable resources</li>
</ul></li>

<li><a href="https://ocaml-multicore.github.io/picos/0.6.0/picos_meta/index.html"><code>picos_meta</code></a> — Integration tests for Picos packages</li>
</ul>

<p>
In addition to the above, <a href="https://github.com/c-cube/moonpool">Moonpool</a> now uses Picos underneath.
</p>

<p>
And, I almost forgot, there is a ready to be merged <a href="https://github.com/ocaml-multicore/kcas/pull/204">PR for Kcas to change it to use Picos</a>.  You should be able to try it with an opam <a href="https://opam.ocaml.org/doc/Manual.html#opamfield-pin-depends">pin-depends</a>.
</p>
</div>
</div>
</div>
