2024.11.12.txt


polytypic announced
───────────────────

  I'm happy to announce that Picos version 0.6.0 has been released!

        Picos is a systems programming interface between effects
        based schedulers and concurrent abstractions.

  A lot of work has been done on Picos since previous announcements.

  You might start on the new minimalist landing page for [Picos], which,
  among other things, allows you to access the documentation of all the
  released Picos versions.

  Also, in case you missed it, a recording of the talk

        [Picos — Interoperable effects based concurrency]

  can be found [here].

  We also held a workshop on concurrency and parallelism at [Fun
  OCaml]. You might enjoy trying out [the exercise we developed for the
  workshop].

  As, for reasons of dependencies, Picos now comes in no less than [8
  packages] and multiple libraries, here is a summary of the packages
  and the libraries inside each package:

  • [`picos'] — Picos — Interoperable effects based concurrency
    • [`picos'] — A systems programming interface between effects based
      schedulers and concurrent abstractions
    • [`picos.domain'] — Minimalistic domain API available both on OCaml
      5 and on OCaml 4
    • [`picos.thread'] — Minimalistic thread API available with or
      without threads.posix

  • [`picos_mux'] — Sample schedulers for Picos
    • [`picos_mux.fifo'] — Basic single-threaded effects based Picos
      compatible scheduler for OCaml 5
    • [`picos_mux.multififo'] — Basic multi-threaded effects based Picos
      compatible scheduler for OCaml 5
    • [`picos_mux.random'] — Randomized multi-threaded effects based
      Picos compatible scheduler for OCaml 5
    • [`picos_mux.thread'] — Basic Thread based Picos compatible
      scheduler for OCaml 4

  • [`picos_std'] — Sample libraries for Picos
    • [`picos_std.finally'] — Syntax for avoiding resource leaks for
      Picos
    • [`picos_std.awaitable'] — Basic futex-like awaitable atomic
      location for Picos
    • [`picos_std.event'] — Basic event abstraction for Picos
    • [`picos_std.structured'] — Basic structured concurrency primitives
      for Picos
    • [`picos_std.sync'] — Basic communication and synchronization
      primitives for Picos

  • [`picos_io'] — Asynchronous IO system for Picos
    • [`picos_io'] — Basic IO facilities based on OCaml standard
      libraries for Picos
    • [`picos_io.select'] — Basic Unix.select based IO event loop for
      Picos
    • [`picos_io.fd'] — Externally reference counted file descriptors

  • [`picos_io_cohttp'] — Cohttp running on Picos IO
    • [`picos_io_cohttp'] — Minimalistic Cohttp implementation using
      Picos_io for Picos

  • [`picos_lwt'] — Lwt interface for Picos
    • [`picos_lwt'] — Direct style Picos compatible interface to Lwt for
      OCaml 5
    • [`picos_lwt.unix'] — Direct style Picos compatible interface to
      Lwt with Lwt_unix for OCaml 5

  • [`picos_aux'] — Auxiliary libraries for Picos
    • [`picos_aux.htbl'] — Lock-free hash table
    • [`picos_aux.mpmcq'] — Lock-free multi-producer, multi-consumer
      queue
    • [`picos_aux.mpscq'] — Lock-free multi-producer, single-consumer
      queue
    • [`picos_aux.rc'] — External reference counting tables for
      disposable resources

  • [`picos_meta'] — Integration tests for Picos packages

  In addition to the above, [Moonpool] now uses Picos underneath.

  And, I almost forgot, there is a ready to be merged [PR for Kcas to
  change it to use Picos].  You should be able to try it with an opam
  [pin-depends].


[Picos] <https://ocaml-multicore.github.io/picos/>

[Picos — Interoperable effects based concurrency]
<https://icfp24.sigplan.org/details/ocaml-2024-papers/5/Picos-Interoperable-effects-based-concurrency>

[here] <https://youtu.be/OuQqblCxJ2Y?t=20115>

[Fun OCaml] <https://fun-ocaml.com/>

[the exercise we developed for the workshop]
<https://github.com/ocaml-multicore/fun-ocaml-workshop>

[8 packages] <https://ocaml-multicore.github.io/picos/0.6.0/>

[`picos']
<https://ocaml-multicore.github.io/picos/0.6.0/picos/index.html>

[`picos']
<https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos/index.html>

[`picos.domain']
<https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos_domain/index.html>

[`picos.thread']
<https://ocaml-multicore.github.io/picos/0.6.0/picos/Picos_thread/index.html>

[`picos_mux']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/index.html>

[`picos_mux.fifo']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_fifo/index.html>

[`picos_mux.multififo']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_multififo/index.html>

[`picos_mux.random']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_random/index.html>

[`picos_mux.thread']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_mux/Picos_mux_thread/index.html>

[`picos_std']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_std/index.html>

[`picos_std.finally']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_finally/index.html>

[`picos_std.awaitable']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_awaitable/index.html>

[`picos_std.event']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_event/index.html>

[`picos_std.structured']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_structured/index.html>

[`picos_std.sync']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_std/Picos_std_sync/index.html>

[`picos_io']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_io/index.html>

[`picos_io']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io/index.html>

[`picos_io.select']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io_select/index.html>

[`picos_io.fd']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_io/Picos_io_fd/index.html>

[`picos_io_cohttp']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_io_cohttp/index.html>

[`picos_io_cohttp']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_io_cohttp/Picos_io_cohttp/index.html>

[`picos_lwt']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/index.html>

[`picos_lwt']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/Picos_lwt/index.html>

[`picos_lwt.unix']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_lwt/Picos_lwt_unix/index.html>

[`picos_aux']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/index.html>

[`picos_aux.htbl']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_htbl/index.html>

[`picos_aux.mpmcq']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_mpmcq/index.html>

[`picos_aux.mpscq']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_mpscq/index.html>

[`picos_aux.rc']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_aux/Picos_aux_rc/index.html>

[`picos_meta']
<https://ocaml-multicore.github.io/picos/0.6.0/picos_meta/index.html>

[Moonpool] <https://github.com/c-cube/moonpool>

[PR for Kcas to change it to use Picos]
<https://github.com/ocaml-multicore/kcas/pull/204>

[pin-depends]
<https://opam.ocaml.org/doc/Manual.html#opamfield-pin-depends>


findlib-1.9.7
═════════════

  Archive:
