2024.11.12.org
* findlib-1.9.7
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://sympa.inria.fr/sympa/arc/caml-list/2024-11/msg00004.html

** Gerd Stolpmann announced


findlib-1.9.7 is out. This is mostly a bugfix release. There is now also
some support for relocability (driven by environment variables),
contributed by Marek Kubica.

For manual, download, manuals, etc. see here:

http://projects.camlcity.org/projects/findlib.html

An updated OPAM package will follow soon.
      



* First release candidate for OCaml 5.2.1
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/first-release-candidate-for-ocaml-5-2-1/15578/1

** octachron announced


The release of OCaml version 5.2.1 is imminent.

OCaml 5.2.1 is a collection of safe but import runtime time bug fixes backported from the 5.3 branch of OCaml. The full list of bug fixes is available below.

In order to ensure that the future release works as expected, we are planning to test a release candidate during the upcoming week.

If you find any bugs, please report them here on [[https://github.com/ocaml/ocaml/issues][GitHub]].

*** Installation Instructions

The base compiler can be installed as an opam switch with the following commands on opam 2.1:
#+begin_example
opam update
opam switch create 5.2.1~rc1
#+end_example

The source code for the release candidate is available on

- [[https://github.com/ocaml/ocaml/archive/5.2.1-rc1.tar.gz][GitHub]]
- [[https://caml.inria.fr/pub/distrib/ocaml-5.2/ocaml-5.2.1~rc1.tar.gz][Inria archives]]

**** Fine-Tuned Compiler Configuration

If you want to tweak the configuration of the compiler, you can switch to the option variant with:
#+begin_example
opam update
opam switch create <switch_name> ocaml-variants.5.2.1~rc1+options <option_list>
#+end_example
where `<option_list>` is a space-separated list of `ocaml-option-*` packages. For instance, for a `flambda` and `no-flat-float-array` switch:
#+begin_example
opam switch create 5.2.1~rc1+flambda+nffa ocaml-variants.5.2.1~rc1+options ocaml-option-flambda ocaml-option-no-flat-float-array
#+end_example

All available options can be listed with `opam search ocaml-option`.

*Changes Since OCaml 5.2.0*
