2024.11.12.html
<div id="outline-container-2" class="outline-2">
<h2 id="2">findlib-1.9.7</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2024-11/msg00004.html">https://sympa.inria.fr/sympa/arc/caml-list/2024-11/msg00004.html</a>
</p>
</div>
<div id="outline-container-org356de91" class="outline-3">
<h3 id="org356de91">Gerd Stolpmann announced</h3>
<div class="outline-text-3" id="text-org356de91">
<p>
findlib-1.9.7 is out. This is mostly a bugfix release. There is now also
some support for relocability (driven by environment variables),
contributed by Marek Kubica.
</p>

<p>
For manual, download, manuals, etc. see here:
</p>

<p>
<a href="http://projects.camlcity.org/projects/findlib.html">http://projects.camlcity.org/projects/findlib.html</a>
</p>

<p>
An updated OPAM package will follow soon.
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">First release candidate for OCaml 5.2.1</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/first-release-candidate-for-ocaml-5-2-1/15578/1">https://discuss.ocaml.org/t/first-release-candidate-for-ocaml-5-2-1/15578/1</a>
</p>
</div>
<div id="outline-container-org96df19e" class="outline-3">
<h3 id="org96df19e">octachron announced</h3>
<div class="outline-text-3" id="text-org96df19e">
<p>
The release of OCaml version 5.2.1 is imminent.
</p>

<p>
OCaml 5.2.1 is a collection of safe but import runtime time bug fixes backported from the 5.3 branch of OCaml. The full list of bug fixes is available below.
</p>

<p>
In order to ensure that the future release works as expected, we are planning to test a release candidate during the upcoming week.
</p>

<p>
If you find any bugs, please report them here on <a href="https://github.com/ocaml/ocaml/issues">GitHub</a>.
</p>
</div>
<div id="outline-container-orgb6dd7fb" class="outline-4">
<h4 id="orgb6dd7fb">Installation Instructions</h4>
<div class="outline-text-4" id="text-orgb6dd7fb">
<p>
The base compiler can be installed as an opam switch with the following commands on opam 2.1:
</p>
<pre class="example" id="org295888f">
opam update
opam switch create 5.2.1~rc1
</pre>

<p>
The source code for the release candidate is available on
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/archive/5.2.1-rc1.tar.gz">GitHub</a></li>
<li><a href="https://caml.inria.fr/pub/distrib/ocaml-5.2/ocaml-5.2.1~rc1.tar.gz">Inria archives</a></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org7bbd6f1"></a>Fine-Tuned Compiler Configuration<br />
<div class="outline-text-5" id="text-org7bbd6f1">
<p>
If you want to tweak the configuration of the compiler, you can switch to the option variant with:
</p>
<pre class="example" id="orgbc980b5">
opam update
opam switch create &lt;switch_name&gt; ocaml-variants.5.2.1~rc1+options &lt;option_list&gt;
</pre>
<p>
where `&lt;option_list&gt;` is a space-separated list of `ocaml-option-*` packages. For instance, for a `flambda` and `no-flat-float-array` switch:
</p>
<pre class="example" id="org55f9e0e">
opam switch create 5.2.1~rc1+flambda+nffa ocaml-variants.5.2.1~rc1+options ocaml-option-flambda ocaml-option-no-flat-float-array
</pre>

<p>
All available options can be listed with `opam search ocaml-option`.
</p>

<p>
<b>Changes Since OCaml 5.2.0</b>
</p>
</div>
</li>
</ul>
</div>
