2024.11.12.html
<div id="outline-container-org7f9f189" class="outline-4">
<h4 id="org7f9f189">Runtime System:</h4>
<div class="outline-text-4" id="text-org7f9f189">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/13207">#13207</a>: Be sure to reload the register caching the exception handler in
caml_c_call and caml_c_call_stack_args, as its value may have been changed
if the OCaml stack is expanded during a callback.
(Miod Vallat, report by Vesa Karvonen, review by Gabriel Scherer and
 Xavier Leroy)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13252">#13252</a>: Rework register assignment in the interpreter code on m68k on Linux,
due to the %a5 register being used by Glibc.
(Miod Vallat, report by Stéphane Glondu, review by Gabriel Scherer and
 Xavier Leroy)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13268">#13268</a>: Fix a call to test in configure.ac that was causing errors when
LDFLAGS contains several words.
(Stéphane Glondu, review by Miod Vallat)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13234">#13234</a>, <a href="https://github.com/ocaml/ocaml/issues/13267">#13267</a>: Open runtime events file in read-write mode on armel
(armv5) systems due to atomic operations limitations on that
platform.
(Stéphane Glondu, review by Miod Vallat and Vincent Laviron)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13188">#13188</a>: fix races in the FFI code coming from the use of Int_val(&#x2026;)
on rooted values inside blocking questions / without the runtime lock.
(Calling Int_val(&#x2026;) on non-rooted immediates is fine, but any
 access to rooted values must be done outside blocking sections /
 with the runtime lock.)
(Etienne Millon, review by Gabriel Scherer, Jan Midtgaard, Olivier Nicole)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13318">#13318</a>: Fix regression in GC alarms, and fix them for flambda.
(Guillaume Munch-Maccagnoni, report by Benjamin Monate, review by
 Vincent Laviron and Gabriel Scherer)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13140">#13140</a>: POWER back-end: fix issue with call to `caml_call_realloc_stack`
from a DLL
(Xavier Leroy, review by Miod Vallat)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13370">#13370</a>: Fix a low-probability crash when calling Gc.counters.
(Demi Marie Obenour, review by Gabriel Scherer)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13402">#13402</a>, <a href="https://github.com/ocaml/ocaml/issues/13512">#13512</a>, <a href="https://github.com/ocaml/ocaml/issues/13549">#13549</a>, <a href="https://github.com/ocaml/ocaml/issues/13553">#13553</a>: Revise bytecode implementation of callbacks
so that it no longer produces dangling registered bytecode fragments.
(Xavier Leroy, report by Jan Midtgaard, analysis by Stephen Dolan,
 review by Miod Vallat)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13502">#13502</a>: Fix misindexing related to `Gc.finalise_last` that could prevent
finalisers from being run.
(Nick Roberts, review by Mark Shinwell)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/13520">#13520</a>: Fix compilation of native-code version of systhreads. Bytecode fields
were being included in the thread descriptors.
(David Allsopp, review by Sébastien Hinderer and Miod Vallat)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">mirage-swapfs</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-mirage-swapfs/15583/1">https://discuss.ocaml.org/t/ann-mirage-swapfs/15583/1</a>
</p>
</div>
<div id="outline-container-orga0aed80" class="outline-3">
<h3 id="orga0aed80">Reynir Björnsson announced</h3>
<div class="outline-text-3" id="text-orga0aed80">
<p>
I am pleased to announce the first release of <a href="https://github.com/robur-coop/mirage-swapfs">mirage-swapfs</a> (swapfs on opam). It is an experimental library to use a mirage block device for ephemeral, append-only, anonymous "files". It was developed for use cases such as in <a href="https://git.robur.coop/robur/opam-mirror/">opam-mirror</a>  where opam package source archives are downloaded. The files are first downloaded to "swap" and if the download succeeds and the checksum is as expected the data is then copied over to the tar filesystem.
</p>

<p>
Internally it uses a weak pointer array (<code>Weak.t</code>) to map "block" offsets to handles. The idea is the garbage collector can help us free up "blocks" if the user forgets to explicitly free the handle. A "block" is (configurable, see <code>blocking_factor</code>) multiple of sectors in order to reduce bookkeeping overhead. With a sector size of 512 bytes the default is 1 MiB per block.
</p>

<p>
See also the documentation <a href="https://robur-coop.github.io/mirage-swapfs/doc/swapfs/index.html">https://robur-coop.github.io/mirage-swapfs/doc/swapfs/index.html</a>
</p>

<p>
I would be interested to hear about other ideas or approaches.
</p>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">Dune dev meeting</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-dev-meeting/14994/16">https://discuss.ocaml.org/t/ann-dune-dev-meeting/14994/16</a>
</p>
</div>
