2024.11.12.txt

  • [#13207]: Be sure to reload the register caching the exception
    handler in caml_c_call and caml_c_call_stack_args, as its value may
    have been changed if the OCaml stack is expanded during a callback.
    (Miod Vallat, report by Vesa Karvonen, review by Gabriel Scherer and
    Xavier Leroy)
  • [#13252]: Rework register assignment in the interpreter code on m68k
    on Linux, due to the %a5 register being used by Glibc.  (Miod
    Vallat, report by Stéphane Glondu, review by Gabriel Scherer and
    Xavier Leroy)
  • [#13268]: Fix a call to test in configure.ac that was causing errors
    when LDFLAGS contains several words.  (Stéphane Glondu, review by
    Miod Vallat)
  • [#13234], [#13267]: Open runtime events file in read-write mode on
    armel (armv5) systems due to atomic operations limitations on that
    platform.  (Stéphane Glondu, review by Miod Vallat and Vincent
    Laviron)
  • [#13188]: fix races in the FFI code coming from the use of
    Int_val(…)  on rooted values inside blocking questions / without the
    runtime lock.  (Calling Int_val(…) on non-rooted immediates is fine,
    but any access to rooted values must be done outside blocking
    sections / with the runtime lock.)  (Etienne Millon, review by
    Gabriel Scherer, Jan Midtgaard, Olivier Nicole)
  • [#13318]: Fix regression in GC alarms, and fix them for flambda.
    (Guillaume Munch-Maccagnoni, report by Benjamin Monate, review by
    Vincent Laviron and Gabriel Scherer)
  • [#13140]: POWER back-end: fix issue with call to
    `caml_call_realloc_stack` from a DLL (Xavier Leroy, review by Miod
    Vallat)
  • [#13370]: Fix a low-probability crash when calling Gc.counters.
    (Demi Marie Obenour, review by Gabriel Scherer)
  • [#13402], [#13512], [#13549], [#13553]: Revise bytecode
    implementation of callbacks so that it no longer produces dangling
    registered bytecode fragments.  (Xavier Leroy, report by Jan
    Midtgaard, analysis by Stephen Dolan, review by Miod Vallat)
  • [#13502]: Fix misindexing related to `Gc.finalise_last` that could
    prevent finalisers from being run.  (Nick Roberts, review by Mark
    Shinwell)
  • [#13520]: Fix compilation of native-code version of
    systhreads. Bytecode fields were being included in the thread
    descriptors.  (David Allsopp, review by Sébastien Hinderer and Miod
    Vallat)


[#13207] <https://github.com/ocaml/ocaml/issues/13207>

[#13252] <https://github.com/ocaml/ocaml/issues/13252>

[#13268] <https://github.com/ocaml/ocaml/issues/13268>

[#13234] <https://github.com/ocaml/ocaml/issues/13234>

[#13267] <https://github.com/ocaml/ocaml/issues/13267>

[#13188] <https://github.com/ocaml/ocaml/issues/13188>

[#13318] <https://github.com/ocaml/ocaml/issues/13318>

[#13140] <https://github.com/ocaml/ocaml/issues/13140>

[#13370] <https://github.com/ocaml/ocaml/issues/13370>

[#13402] <https://github.com/ocaml/ocaml/issues/13402>

[#13512] <https://github.com/ocaml/ocaml/issues/13512>

[#13549] <https://github.com/ocaml/ocaml/issues/13549>

[#13553] <https://github.com/ocaml/ocaml/issues/13553>

[#13502] <https://github.com/ocaml/ocaml/issues/13502>

[#13520] <https://github.com/ocaml/ocaml/issues/13520>


mirage-swapfs
═════════════

  Archive: <https://discuss.ocaml.org/t/ann-mirage-swapfs/15583/1>


Reynir Björnsson announced
──────────────────────────

  I am pleased to announce the first release of [mirage-swapfs] (swapfs
  on opam). It is an experimental library to use a mirage block device
  for ephemeral, append-only, anonymous "files". It was developed for
  use cases such as in [opam-mirror] where opam package source archives
  are downloaded. The files are first downloaded to "swap" and if the
  download succeeds and the checksum is as expected the data is then
  copied over to the tar filesystem.

  Internally it uses a weak pointer array (`Weak.t') to map "block"
  offsets to handles. The idea is the garbage collector can help us free
  up "blocks" if the user forgets to explicitly free the handle. A
  "block" is (configurable, see `blocking_factor') multiple of sectors
  in order to reduce bookkeeping overhead. With a sector size of 512
  bytes the default is 1 MiB per block.

  See also the documentation
  <https://robur-coop.github.io/mirage-swapfs/doc/swapfs/index.html>

  I would be interested to hear about other ideas or approaches.


[mirage-swapfs] <https://github.com/robur-coop/mirage-swapfs>

[opam-mirror] <https://git.robur.coop/robur/opam-mirror/>


Dune dev meeting
════════════════

  Archive: <https://discuss.ocaml.org/t/ann-dune-dev-meeting/14994/16>
