2024.11.12.org
** Etienne Marais announced


We will hold our regular Dune dev meeting tomorrow, on Wednesday, November, 13th at *9:00* CET. :warning: Note that the session has been moved *one hour earlier*. As usual, the session will be one hour long.

Whether you are a maintainer, a regular contributor, a new joiner or just curious, you are welcome to join: these discussions are opened! The goal of these meetings is to provide a place to discuss the ongoing work together and synchronise between the Dune developers !:smile:

*** :calendar: Agenda

The agenda is available on the [[https://github.com/ocaml/dune/wiki/dev-meeting-2024-11-13][meeting dedicated page]]. Feel free to ask if you want to add more items in it.

*** :computer: Links

- Meeting link:[[https://us06web.zoom.us/j/85096877776?pwd=cWNhU1dHQ1ZNSjZuOUZCQ0h2by9Udz09][ zoom]]
- Calendar event:[[https://calendar.google.com/calendar/embed?src=c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319%40group.calendar.google.com][ google calendar]]
- Wiki with information and previous notes:[[https://github.com/ocaml/dune/wiki#dev-meetings][ GitHub Wiki]]
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 6
:END:
** From the ocaml.org blog


Here are links from many OCaml blogs aggregated at [[https://ocaml.org/blog/][the ocaml.org blog]].

- [[https://frama-c.com/fc-versions/zinc.html][Beta release of Frama-C 30.0~beta (Zinc)]]
- [[https://tarides.com/blog/2024-11-06-making-ocaml-mainstream-support-our-open-source-work-on-github][Making OCaml Mainstream: Support Our Open Source Work on GitHub]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe to the [[https://sympa.inria.fr/sympa/info/caml-list][caml-list]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
