2024.11.12.html
<div id="outline-container-orgfe177b2" class="outline-3">
<h3 id="orgfe177b2">Etienne Marais announced</h3>
<div class="outline-text-3" id="text-orgfe177b2">
<p>
We will hold our regular Dune dev meeting tomorrow, on Wednesday, November, 13th at <b>9:00</b> CET. :warning: Note that the session has been moved <b>one hour earlier</b>. As usual, the session will be one hour long.
</p>

<p>
Whether you are a maintainer, a regular contributor, a new joiner or just curious, you are welcome to join: these discussions are opened! The goal of these meetings is to provide a place to discuss the ongoing work together and synchronise between the Dune developers !:smile:
</p>
</div>
<div id="outline-container-orgb3f999e" class="outline-4">
<h4 id="orgb3f999e">:calendar: Agenda</h4>
<div class="outline-text-4" id="text-orgb3f999e">
<p>
The agenda is available on the <a href="https://github.com/ocaml/dune/wiki/dev-meeting-2024-11-13">meeting dedicated page</a>. Feel free to ask if you want to add more items in it.
</p>
</div>
</div>
<div id="outline-container-org39843fc" class="outline-4">
<h4 id="org39843fc">:computer: Links</h4>
<div class="outline-text-4" id="text-org39843fc">
<ul class="org-ul">
<li>Meeting link:<a href="https://us06web.zoom.us/j/85096877776?pwd=cWNhU1dHQ1ZNSjZuOUZCQ0h2by9Udz09"> zoom</a></li>
<li>Calendar event:<a href="https://calendar.google.com/calendar/embed?src=c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319%40group.calendar.google.com"> google calendar</a></li>
<li>Wiki with information and previous notes:<a href="https://github.com/ocaml/dune/wiki#dev-meetings"> GitHub Wiki</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="6">Other OCaml News</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga24a281" class="outline-3">
<h3 id="orga24a281">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-orga24a281">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://frama-c.com/fc-versions/zinc.html">Beta release of Frama-C 30.0~beta (Zinc)</a></li>
<li><a href="https://tarides.com/blog/2024-11-06-making-ocaml-mainstream-support-our-open-source-work-on-github">Making OCaml Mainstream: Support Our Open Source Work on GitHub</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org48911c6" class="outline-2">
<h2 id="org48911c6">Old CWN</h2>
<div class="outline-text-2" id="text-org48911c6">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="orgf00bc27">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
